[
  {
    "entity": "Drom.ru",
    "subEntity": "Software Engineering Manager",
    "location": "Istanbul, Republic of Turkey",
    "time": "July 2021 - Present",
    "description": [
      "Managing, mentoring and driving several Android teams in 3 different projects with a great delegation experience and many successful features.",
      "Conducting one-to-one's, technical interviews, new employees’ onboard-ing, team and personal performance review.",
      "Solving company-wide problems, adopted modular architecture, measured app’s performance metrics, implemented image performance test app.",
      "Conducted a lot of challenging researches, including image performance problems, billing system integration design, data access problem, etc.",
      "Implemented an engaging company newsletter to help colleagues stay tuned with industry news and state-of-the-art reports/lectures."
    ]
  },
  {
    "entity": null,
    "subEntity": "Android Software Engineer",
    "location": "Vladivostok, Russian Federation",
    "time": "Jan 2019 - July 2021",
    "description": [
      "Collaborated on the implementation and further refactoring of a new app and supporting existing applications with a million DAU.",
      "Implemented a chatbot solution using a finite state machine with a graph as a data structure.",
      "Collaborated on the implementation of a super-app approach by reusing existing Drom Fines app in the main Drom app.",
      "Optimized important SQLite FTS queries time in the app by 40%."
    ]
  },
  {
    "entity": "e2e4.ru",
    "subEntity": "Backend Software Engineer",
    "location": "Novosibirsk, Russian Federation",
    "time": "July 2017 - Dec 2018",
    "description": [
      "Refactored JBoss backend service to Spring Boot, rewriting 90% of existing SQL queries.",
      "Achieved the target of increasing the speed of these queries by 35%."
    ]
  },
  {
    "entity": null,
    "subEntity": "Android Software Engineer",
    "location": "Novosibirsk, Russian Federation",
    "time": "Oct 2016 - July 2017",
    "description": [
      "Developed an Android client for browsing user’s orders.",
      "Redeveloped an existing app which increased app speed and saved costs for the company’s warehouses."
    ]
  }
]
